OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantBoussinesqPenaltySimpleFoam/cases/solid_fluid/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/domain0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 273;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 350;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
