OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantBoussinesqPenaltySimpleFoam/cases/solid_fluid/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.026;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.026;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(bottom|walls)"
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
