OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantBoussinesqPenaltySimpleFoam/cases/solid_fluid/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              1e-06; // water

// Thermal expansion coefficient
beta            0; //3e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              7;

// Turbulent Prandtl number
Prt             7;

alphaSolid 11.234e-5; // thermal conductivity of copper, [m^2/s, Heat conduction, Hahn]

// ************************************************************************* //
